### Terraform Plan (staging - All Layers)

#### security
<details>
<summary>Click to expand</summary>

```
[command]/home/runner/work/_temp/a08bc4e8-63df-4a62-9cf5-d5b8c5267199/terraform-bin show -no-color tfplan

Changes to Outputs:
  ~ datasource_password     = (sensitive value)
  ~ file_upload_auth_secret = (sensitive value)
  ~ locations_auth_secret   = (sensitive value)
  ~ secrets_arn             = (sensitive value)

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
::debug::Terraform exited with code 0.
::debug::stdout: %0AChanges to Outputs:%0A  ~ datasource_password     = (sensitive value)%0A  ~ file_upload_auth_secret = (sensitive value)%0A  ~ locations_auth_secret   = (sensitive value)%0A  ~ secrets_arn             = (sensitive value)%0A%0AYou can apply this plan to save these new output values to the Terraform%0Astate, without changing any real infrastructure.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

#### networking
<details>
<summary>Click to expand</summary>

```
[command]/home/runner/work/_temp/4b3e0844-20c6-4f84-9d44-10e6d767252e/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc_endpoint.dynamodb_gw_endpoint must be replaced
-/+ resource "aws_vpc_endpoint" "dynamodb_gw_endpoint" {
      ~ arn                        = "arn:aws:ec2:eu-central-1:387836084035:vpc-endpoint/vpce-0f09fd9ab5da8e286" -> (known after apply)
      ~ cidr_blocks                = [
          - "35.71.105.128/26",
          - "52.94.17.0/24",
          - "35.71.105.0/25",
        ] -> (known after apply)
      ~ dns_entry                  = [] -> (known after apply)
      ~ id                         = "vpce-0f09fd9ab5da8e286" -> (known after apply)
      ~ ip_address_type            = "ipv4" -> (known after apply)
      ~ network_interface_ids      = [] -> (known after apply)
      ~ owner_id                   = "387836084035" -> (known after apply)
      ~ policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
      ~ prefix_list_id             = "pl-66a5400f" -> (known after apply)
      ~ private_dns_enabled        = false -> (known after apply)
      ~ requester_managed          = false -> (known after apply)
      ~ route_table_ids            = [
          - "rtb-075112c8a1e3e10d9",
        ] -> (known after apply)
      ~ security_group_ids         = [] -> (known after apply)
      ~ service_region             = "eu-central-1" -> (known after apply)
      ~ state                      = "available" -> (known after apply)
      ~ subnet_ids                 = [] -> (known after apply)
      ~ tags                       = {
          ~ "Environment" = "ephemeral" -> "staging"
        }
      ~ tags_all                   = {
          ~ "Environment" = "ephemeral" -> "staging"
        }
      ~ vpc_id                     = "vpc-0697904cda33911c7" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)

      ~ dns_options (known after apply)
      - dns_options {
          - dns_record_ip_type                             = "service-defined" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      ~ subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gw_endpoint must be replaced
-/+ resource "aws_vpc_endpoint" "s3_gw_endpoint" {
      ~ arn                        = "arn:aws:ec2:eu-central-1:387836084035:vpc-endpoint/vpce-0e8546c51dfd18432" -> (known after apply)
      ~ cidr_blocks                = [
          - "52.219.44.0/22",
          - "52.219.208.0/22",
          - "3.5.136.0/22",
          - "52.219.218.0/24",
          - "52.219.140.0/24",
          - "16.12.32.0/22",
          - "52.219.72.0/22",
          - "16.15.20.0/22",
          - "3.5.134.0/23",
          - "16.12.24.0/21",
          - "52.219.168.0/22",
        ] -> (known after apply)
      ~ dns_entry                  = [] -> (known after apply)
      ~ id                         = "vpce-0e8546c51dfd18432" -> (known after apply)
      ~ ip_address_type            = "ipv4" -> (known after apply)
      ~ network_interface_ids      = [] -> (known after apply)
      ~ owner_id                   = "387836084035" -> (known after apply)
      ~ policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
      ~ prefix_list_id             = "pl-6ea54007" -> (known after apply)
      ~ private_dns_enabled        = false -> (known after apply)
      ~ requester_managed          = false -> (known after apply)
      ~ route_table_ids            = [
          - "rtb-075112c8a1e3e10d9",
        ] -> (known after apply)
      ~ security_group_ids         = [] -> (known after apply)
      ~ service_region             = "eu-central-1" -> (known after apply)
      ~ state                      = "available" -> (known after apply)
      ~ subnet_ids                 = [] -> (known after apply)
      ~ tags                       = {
          ~ "Environment" = "ephemeral" -> "staging"
        }
      ~ tags_all                   = {
          ~ "Environment" = "ephemeral" -> "staging"
        }
      ~ vpc_id                     = "vpc-0697904cda33911c7" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)

      ~ dns_options (known after apply)
      - dns_options {
          - dns_record_ip_type                             = "service-defined" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      ~ subnet_configuration (known after apply)
    }

  # random_id.ephemeral will be destroyed
  # (because random_id.ephemeral is not in configuration)
  - resource "random_id" "ephemeral" {
      - b64_std     = "26E=" -> null
      - b64_url     = "26E" -> null
      - byte_length = 2 -> null
      - dec         = "56225" -> null
      - hex         = "dba1" -> null
      - id          = "26E" -> null
    }

  # module.vpc.aws_default_network_acl.this[0] must be replaced
-/+ resource "aws_default_network_acl" "this" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:387836084035:network-acl/acl-054c2b8ed7bbf7864" -> (known after apply)
      ~ default_network_acl_id = "acl-054c2b8ed7bbf7864" -> (known after apply) # forces replacement
      ~ id                     = "acl-054c2b8ed7bbf7864" -> (known after apply)
      ~ owner_id               = "387836084035" -> (known after apply)
      - subnet_ids             = [
          - "subnet-01514ee14665e5900",
          - "subnet-03847709ebedd1566",
          - "subnet-0601f8f47bb179d85",
          - "subnet-07c2c0dbc48bcc753",
          - "subnet-099c4c919e1887ea3",
          - "subnet-0e6332f912797f3cc",
        ] -> null
      ~ tags                   = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ vpc_id                 = "vpc-0697904cda33911c7" -> (known after apply)
        # (1 unchanged attribute hidden)

      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
            # (1 unchanged attribute hidden)
        }
      - egress {
          - action          = "allow" -> null
          - cidr_block      = "0.0.0.0/0" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - protocol        = "-1" -> null
          - rule_no         = 100 -> null
          - to_port         = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
            # (1 unchanged attribute hidden)
        }
      - ingress {
          - action          = "allow" -> null
          - cidr_block      = "0.0.0.0/0" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - protocol        = "-1" -> null
          - rule_no         = 100 -> null
          - to_port         = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] must be replaced
-/+ resource "aws_default_route_table" "default" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:387836084035:route-table/rtb-0018541872adb94f3" -> (known after apply)
      ~ default_route_table_id = "rtb-0018541872adb94f3" -> (known after apply) # forces replacement
      ~ id                     = "rtb-0018541872adb94f3" -> (known after apply)
      ~ owner_id               = "387836084035" -> (known after apply)
      - propagating_vgws       = [] -> null
      ~ route                  = [] -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ vpc_id                 = "vpc-0697904cda33911c7" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] must be replaced
-/+ resource "aws_default_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:387836084035:security-group/sg-0b281483a1906271a" -> (known after apply)
      ~ description            = "default VPC security group" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0b281483a1906271a" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "default" -> (known after apply)
      + name_prefix            = (known after apply)
      ~ owner_id               = "387836084035" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name" = "ephemeral-trip-planner-app-vpc-dba1-default" -> "staging-trip-planner-app-vpc-default"
        }
      ~ vpc_id                 = "vpc-0697904cda33911c7" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-central-1"
      + tags                 = {
          + "Name" = "staging-trip-planner-app-vpc-eu-central-1a"
        }
      + tags_all             = {
          + "Name" = "staging-trip-planner-app-vpc-eu-central-1a"
        }
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known 

...(truncated)
```

</details>

#### database
<details>
<summary>Click to expand</summary>

```
[command]/home/runner/work/_temp/63e2a432-185f-48a0-aa23-cb0b4b4eb57e/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.rds_availability will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_availability" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when DB has CPU utilization of 0% for 5 minutes- RDS is potentially down"
      + alarm_name                            = "staging-RDS-CPUUtilization-Down"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "staging-trip-planner-app-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_free_storage will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_free_storage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when RDS free storage space is low"
      + alarm_name                            = "staging-RDS-Free-Storage-Low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "staging-trip-planner-app-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2000000000
      + treat_missing_data                    = "missing"
    }

  # aws_db_subnet_group.rds_subnet_group will be created
  + resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "staging-trip-planner-app-rds-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "eu-central-1"
      + subnet_ids              = [
          + "subnet-01514ee14665e5900",
          + "subnet-03847709ebedd1566",
          + "subnet-0601f8f47bb179d85",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.sg_rds will be created
  + resource "aws_security_group" "sg_rds" {
      + arn                    = (known after apply)
      + description            = "Allow ECS tasks access to database and internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "staging-trip-planner-app-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0697904cda33911c7"
    }

  # module.rds_sns_alerts.aws_kms_key.sns_cmk will be created
  + resource "aws_kms_key" "sns_cmk" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS CMK"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "eu-central-1"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.rds_sns_alerts.aws_sns_topic.alerts will be created
  + resource "aws_sns_topic" "alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "staging-trip-planner-app-staging-trip-planner-app-db-sns-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "App"         = "trip-planner-app"
          + "Environment" = "staging"
          + "Service"     = "staging-trip-planner-app-db"
        }
      + tags_all                    = {
          + "App"         = "trip-planner-app"
          + "Environment" = "staging"
          + "Service"     = "staging-trip-planner-app-db"
        }
      + tracing_config              = (known after apply)
    }

  # module.rds_sns_alerts.aws_sns_topic_subscription.alerts_email will be created
  + resource "aws_sns_topic_subscription" "alerts_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "rmliantsoa@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "eu-central-1"
      + topic_arn                       = (known after apply)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "staging-trip-planner-app-database-name"
      + db_subnet_group_name                  = "staging-trip-planner-app-rds-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "staging-trip-planner-app-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "eu-central-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id"                  = "staging-trip-planner-app-db"
          + "snapshot_identifier" = null
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "staging-trip-planner-app-db parameter group"
      + family       

...(truncated)
```

</details>

#### backend
<details>
<summary>Click to expand</summary>

```
[command]/home/runner/work/_temp/7ced084e-7fd5-4e28-87ec-a8a9dfd3b8f0/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.alb_5xx_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_5xx_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ALB is returning too many 5xx errors"
      + alarm_name                            = "alb-5xx-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.alb_high_latency will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_high_latency" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ALB latency above 2 seconds for 10 minutes"
      + alarm_name                            = "alb-high-latency"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.alb_unhealthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ALB target group has unhealthy hosts"
      + alarm_name                            = "staging-alb-unhealthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.ecs_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when ECS CPU utilization exceeds 90%"
      + alarm_name                            = "staging-trip-planner-app-ecs-service-CPUHigh"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging-trip-planner-app-ecs-cluster"
          + "ServiceName" = "staging-trip-planner-app-ecs-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.ecs_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when ECS Memory utilization exceeds 90%"
      + alarm_name                            = "staging-trip-planner-app-ecs-service-MemoryHigh"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging-trip-planner-app-ecs-cluster"
          + "ServiceName" = "staging-trip-planner-app-ecs-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + region                                = "eu-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.ecs_unhealthy_tasks will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_unhealthy_tasks" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when ECS service has unhealthy tasks"
      + alarm_name                            = "staging-trip-planner-app-ecs-service-UnhealthyTasks"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging-trip-planner-app-ecs-cluster"
          + "ServiceName" = "staging-trip-planner-app-ecs-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnhealthyTaskCount"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + region                                = "eu-central-1"
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_wafv2_web_acl.alb_waf will be created
  + resource "aws_wafv2_web_acl" "alb_waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF for ALB"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "staging-trip-planner-app-alb-waf"
      + name_prefix                 = (known after apply)
      + region                      = "eu-central-1"
      + scope                       = "REGIONAL"
      + tags_all                    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "staging-trip-planner-app-BlockHydra"
          + priority = 103

          + action {
              + block {
                }
            }

          + statement {
              + byte_match_statement {
                  + positional_constraint = "CONTAINS"
                  + search_string         = "Hydra"

                  + field_to_match {
                      + single_header {
                          + name = "user-agent"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-trip-planner-app-BlockHydra"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "staging-trip-planner-app-BlockMasscan"
          + priority = 104

          + action {
              + block {
                }
            }

          + statement {
              + byte_match_statement {
                  + positional_constraint = "CONTAINS"
                  + search_string         = "Masscan"

                  + field_to_match {
                      + single_header {
                          + name = "user-agent"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-trip-planner-app-BlockMasscan"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "staging-trip-planner-app-BlockNikto"
          + priority = 100

          + action {
              + block {
                }
            }

          + statement {
              + byte_match_statement {
                  + positional_constraint = "CONTAINS"
                  + search_string         = "Nikto"

                  + field_to_match {
                      + single_header {
                          + name = "user-agent"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-trip-planner-app-BlockNikto"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "staging-trip-planner-app-BlockSQLMap"
          + priority = 101

          + action {
              + block {
                }
            }

          + statement {
              + byte_match_statement {
                  + positional_constraint = "CONTAINS"
                  + search_string         = "SQLMap"

                  + field_to_match {
                      + single_header {
                          + name = "user-agent"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-trip-planner-app-BlockSQLMap"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "staging-trip-planner-app-BlockZAP"
          + priority = 102

          + action {
              + block {
                }
            }

          + statement {
              + byte_match_statement {
                  + positional_constraint = "CONTAINS"
                  + search_string         = "ZAP"

                  + field_to_match {
                      + single_header {
                          + name = "user-agent"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-trip-planner-app-BlockZAP"
              + sampled_requests_enabled   =

...(truncated)
```

</details>

